---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RailingSystemHandrailsTypesParam
source: html/3630eff4-cd61-ceeb-a323-6b7f67fcc316.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RailingSystemHandrailsTypesParam Property

"Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RailingSystemHandrailsTypesParam { get; }
```